/*
 * Присвоєння за посиланням і за значенням
 *
 * Примітиви і складні типи
 */

/*
? Створіть змінну a = 10.
? Створіть та привласніть змінній b -> змінну a
? Виведіть до консолі обидві ці змінні
? Змініть значення змінної a і ще раз виведіть у консоль
*/

// let a = 10;
// const b = a;

// console.log(a);
// console.log(b);

// a = 20;

// console.log(a);
// console.log(b);

/*
? Створіть масив arr1 = [1, 2, 3].
? Створіть та привласніть масиву arr2 -> масив arr1
? Виведіть до консолі обидва цих масива
? Змініть елемент в масиві arr1 і ще раз виведіть обидва масиви в консоль
*/

const arr1 = [1, 2, 3];
const arr2 = arr1;

console.log(arr1);
console.log(arr2);

arr2[0] = 10;

console.log(arr1);
console.log(arr2);
